SoCXin/GD32E103/src/Project/USBFS/USB_Device/Audio/src/gd32e10x_audio_codec.c
    /* Update the current audio pointer position */
    CurrentPos = pBuffer + DMA_MAX(AudioTotalSize);

    return 0;
}

/**
  * @brief  This function Pauses or Resumes the audio file stream. In case
  *         of using DMA, the DMA Pause feature is used. In all cases the I2S 
  *         peripheral is disabled. 
  * @WARNING When calling EVAL_AUDIO_PauseResume() function for pause, only
  *         this function should be called for resume (use of EVAL_AUDIO_Play() 
  *         function for resume could lead to unexpected behaviour).
  * @param  Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *         from 0) to resume. 
  * @param  Addr: Address from/at which the audio stream should resume/pause.
  * @param  Size: Number of data to be configured for next resume.
  * @retval o if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_PauseResume(uint32_t Cmd, uint32_t Addr, uint32_t Size)
{
    if (Cmd != AUDIO_PAUSE) {
        /* Call the Media layer pause/resume function */
        Audio_MAL_PauseResume(Cmd, Addr, Size);

        /* Call the Audio Codec Pause/Resume function */
        if (Codec_PauseResume(Cmd) != 0) {
            return 1;
        } else {
            return 0;
        }
    } else {
        /* Call the Audio Codec Pause/Resume function */
        if (Codec_PauseResume(Cmd) != 0) {
            return 1;
        } else {
            /* Call the Media layer pause/resume function */
            Audio_MAL_PauseResume(Cmd, Addr, Size);

            /* Return 0 if all operations are OK */
            return 0;
        }
    }
}

/**
  * @brief  Stops audio playing and Power down the Audio Codec.
  * @param  Option:
  *   This parameter can be any one of the following values:
  *     @arg CODEC_PDWN_SW for software power off (by writing registers)
             Then no need to reconfigure the Codec after power on.
  *     @arg CODEC_PDWN_HW completely shut down the codec (physically). Then need 
  *          to reconfigure the Codec after power on.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Stop(uint32_t Option)
{
    /* Call Audio Codec Stop function */
    if (Codec_Stop(Option) != 0) {
        return 1;
    } else {
        /* Call Media layer Stop function */
        Audio_MAL_Stop();

        /* Update the remaining data number */
        AudioRemSize = AudioTotalSize;    

        /* Return 0 when all operations are correctly done */
        return 0;
    }
}

/**
  * @brief Controls the current audio volume level. 
  * @param Volume: Volume level to be set in percentage from 0% to 100% (0 for 
  *        Mute and 100 for Max volume level).
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_VolumeCtl(uint8_t Volume)
{
    /* Call the codec volume control function with converted volume value */
    return (Codec_VolumeCtrl(VOLUME_CONVERT(Volume)));
}

/**
  * @brief Enable or disable the MUTE mode by software 
  * @param Cmd: could be AUDIO_MUTE_ON to mute sound or AUDIO_MUTE_OFF to 
  *        unmute the codec and restore previous volume level.
  * @retval o if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Mute(uint32_t Cmd)
{
    /* Call the Codec Mute function */
    return (Codec_Mute(Cmd));
}

/**
  * @brief  This function handles main Media layer interrupt. 
  * @param  None.
  * @retval 0 if correct communication, else wrong communication
  */
void Audio_MAL_IRQHandler(void)
{    
#ifndef AUDIO_MAL_MODE_NORMAL
    uint16_t *pAddr = (uint16_t *)CurrentPos;
    uint32_t Size = AudioRemSize;
#endif /* AUDIO_MAL_MODE_NORMAL */
}

/* CS43L22 Audio Codec Control Functions */

/**
  * @brief  Initializes the audio codec and all related interfaces (control 
  *         interface: I2C and audio interface: I2S)
  * @param  OutputDevice:
  *   This parameter can be any one of the following values:
  *     @arg OUTPUT_DEVICE_SPEAKER
  *     @arg OUTPUT_DEVICE_HEADPHONE
  *     @arg OUTPUT_DEVICE_BOTH
  *     @arg OUTPUT_DEVICE_AUTO
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to paly the audio stream.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_Init(uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq)
{
    uint32_t counter = 0;

    /* Configure the Codec related IOs */
    Codec_GPIO_Init();

    /* Reset the Codec Registers */
    Codec_Reset();

    /* Initialize the Control interface of the Audio Codec */
    Codec_CtrlInterface_Init();

    /* Keep Codec powered OFF */
    counter += Codec_WriteRegister(0x02, 0x01);

    switch (OutputDevice) {
        case OUTPUT_DEVICE_SPEAKER:
            counter += Codec_WriteRegister(0x04, 0xFA); /* SPK always ON & HP always OFF */
            OutputDev = 0xFA;
            break;

        case OUTPUT_DEVICE_HEADPHONE:
            counter += Codec_WriteRegister(0x04, 0xAF); /* SPK always OFF & HP always ON */
            OutputDev = 0xAF;
            break;

        case OUTPUT_DEVICE_BOTH:
            counter += Codec_WriteRegister(0x04, 0xAA); /* SPK always ON & HP always ON */
            OutputDev = 0xAA;
            break;

        case OUTPUT_DEVICE_AUTO:
            counter += Codec_WriteRegister(0x04, 0x05); /* Detect the HP or the SPK automatically */
            OutputDev = 0x05;
            break;

        default:
            counter += Codec_WriteRegister(0x04, 0x05); /* Detect the HP or the SPK automatically */
            OutputDev = 0x05;
            break;
    }

    /* Clock configuration: Auto detection */  
    counter += Codec_WriteRegister(0x05, 0x81);

    /* Set the Slave Mode and the audio Standard */  
    counter += Codec_WriteRegister(0x06, CODEC_STANDARD);

    /* Set the Master volume */
    Codec_VolumeCtrl(Volume);

    /* If the Speaker is enabled, set the Mono mode and volume attenuation level */
    if (OutputDevice != OUTPUT_DEVICE_HEADPHONE) {
        /* Set the Speaker Mono mode */
        counter += Codec_WriteRegister(0x0F , 0x06);

        /* Set the Speaker attenuation level */
        counter += Codec_WriteRegister(0x24, 0x00);
        counter += Codec_WriteRegister(0x25, 0x00);
    }

    /* Power on the Codec */
    counter += Codec_WriteRegister(0x02, 0x9E);

    /* Additional configuration for the CODEC. These configurations are done to reduce
       the time needed for the Codec to power off. If these configurations are removed,
       then a long delay should be added between powering off the Codec and switching
       off the I2S peripheral MCLK clock (which is the operating clock for Codec).
       If this delay is not inserted, then the codec will not shut down propoerly and
       it results in high noise after shut down. */

    /* Disable the analog soft ramp */
    counter += Codec_WriteRegister(0x0A, 0x00);

