SoCXin/GD32E103/src/Project/USBFS/USB_Device/Audio/src/gd32e10x_audio_codec.c
    /* Disable the digital soft ramp */
    counter += Codec_WriteRegister(0x0E, 0x04);

    /* Disable the limiter attack level */
    counter += Codec_WriteRegister(0x27, 0x00);

    /* Adjust Bass and Treble levels */
    counter += Codec_WriteRegister(0x1F, 0x0F);

    /* Adjust PCM volume level */
    counter += Codec_WriteRegister(0x1A, 0x0A);
    counter += Codec_WriteRegister(0x1B, 0x0A);

    /* Configure the I2S peripheral */
    Codec_AudioInterface_Init(AudioFreq);

    /* Return communication control value */
    return counter;
}

/**
  * @brief  Restore the audio codec state to default state and free all used 
  *         resources.
  * @param  None.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_DeInit(void)
{
    uint32_t counter = 0;

    /* Reset the Codec Registers */
    Codec_Reset();

    /* Keep Codec powered OFF */
    counter += Codec_WriteRegister(0x02, 0x01);    

    /* Deinitialize all use GPIOs */
    Codec_GPIO_DeInit();

    /* Disable the Codec control interface */
    Codec_CtrlInterface_DeInit();

    /* Deinitialize the Codec audio interface (I2S) */
    Codec_AudioInterface_DeInit(); 

    /* Return communication control value */
    return counter;  
}

/**
  * @brief  Start the audio Codec play feature.
  *         For this codec no Play options are required.
  * @param  None.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_Play(void)
{
    /* No actions required on Codec level for play command */

    /* Return communication control value */
    return 0;
}

/**
  * @brief  Pauses and resumes playing on the audio codec.
  * @param  Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *         from 0) to resume. 
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_PauseResume(uint32_t Cmd)
{
    uint32_t counter = 0;

    /* Pause the audio file playing */
    if (Cmd == AUDIO_PAUSE) {
        /* Mute the output first */
        counter += Codec_Mute(AUDIO_MUTE_ON);

        /* Put the Codec in Power save mode */
        counter += Codec_WriteRegister(0x02, 0x01);

    /* AUDIO_RESUME */
    } else {
        /* Unmute the output first */
        counter += Codec_Mute(AUDIO_MUTE_OFF);

        counter += Codec_WriteRegister(0x04, OutputDev);

        /* Exit the Power save mode */
        counter += Codec_WriteRegister(0x02, 0x9E); 
    }

    return counter;
}

/**
  * @brief  Stops audio Codec playing. It powers down the codec.
  * @param  CodecPdwnMode:
  *   This parameter can be any one of the following values:
  *     @arg CODEC_PDWN_SW: only mutes the audio codec. When resuming from this 
  *          mode the codec keeps the prvious initialization (no need to re-Initialize
  *          the codec registers)
  *     @arg CODEC_PDWN_HW: Physically power down the codec. When resuming from this
  *          mode, the codec is set to default configuration (user should re-Initialize
  *          the codec in order to play again the audio stream).
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_Stop(uint32_t CodecPdwnMode)
{
    uint32_t counter = 0;   

    /* Mute the output first */
    Codec_Mute(AUDIO_MUTE_ON);

    if (CodecPdwnMode == CODEC_PDWN_SW) {
        /* Power down the DAC and the speaker (PMDAC and PMSPK bits)*/
        counter += Codec_WriteRegister(0x02, 0x9F);

    /* CODEC_PDWN_HW */
    } else {
        /* Power down the DAC components */
        counter += Codec_WriteRegister(0x02, 0x9F);

        /* Wait at least 100ms */
        Delay(0xFFF);

        /* Reset The pin */
        //IOE_WriteIOPin(AUDIO_RESET_PIN, BitReset);
    }

    return counter;
}

/**
  * @brief  Highers or Lowers the codec volume level.
  * @param  Volume: a byte value from 0 to 255 (refer to codec registers 
  *         description for more details).
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_VolumeCtrl(uint8_t Volume)
{
    uint32_t counter = 0;

    if (Volume > 0xE6) {
        /* Set the Master volume */
        counter += Codec_WriteRegister(0x20, Volume - 0xE7);
        counter += Codec_WriteRegister(0x21, Volume - 0xE7);
    } else {
        /* Set the Master volume */
        counter += Codec_WriteRegister(0x20, Volume + 0x19);
        counter += Codec_WriteRegister(0x21, Volume + 0x19);
    }

    return counter;
}

/**
  * @brief  Enables or disables the mute feature on the audio codec.
  * @param  Cmd: AUDIO_MUTE_ON to enable the mute or AUDIO_MUTE_OFF to disable the
  *              mute mode.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_Mute(uint32_t Cmd)
{
    uint32_t counter = 0;

    /* Set the Mute mode */
    if (Cmd == AUDIO_MUTE_ON) {
        counter += Codec_WriteRegister(0x04, 0xFF);

        //counter += Codec_WriteRegister(0x0D, 0x63);
        //counter += Codec_WriteRegister(0x0F, 0xF6);

    /* AUDIO_MUTE_OFF Disable the Mute */
    } else {
        counter += Codec_WriteRegister(0x04, OutputDev);

        //counter += Codec_WriteRegister(0x0D, 0x60);
        //counter += Codec_WriteRegister(0x0F, 0x06);
    }

    return counter;
}

/**
  * @brief  Resets the audio codec. It restores the default configuration of the 
  *         codec (this function shall be called before initializing the codec).
  * @note   This function calls an external driver function: The IO Expander driver.
  * @param  None.
  * @retval 0 if correct communication, else wrong communication
  */
static void Codec_Reset(void)
{
    /* Configure the IO Expander (to use the Codec Reset pin mapped on the IOExpander) */
    //IOE_Config();

    /* Power Down the codec */
    //IOE_WriteIOPin(AUDIO_RESET_PIN, BitReset);

    /* wait for a delay to insure registers erasing */
    //Delay(CODEC_RESET_DELAY); 

    /* Power on the codec */
    //IOE_WriteIOPin(AUDIO_RESET_PIN, BitSet);
}

/**
  * @brief  Switch dynamically (while audio file is played) the output target (speaker or headphone).
  * @note   This function modifies a global variable of the audio codec driver: OutputDev.
  * @param  None.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_SwitchOutput(uint8_t Output)
{
    uint8_t counter = 0;

    switch (Output) {
    case OUTPUT_DEVICE_SPEAKER:
        counter += Codec_WriteRegister(0x04, 0xFA); /* SPK always ON & HP always OFF */
        OutputDev = 0xFA;
        break;

    case OUTPUT_DEVICE_HEADPHONE:
        counter += Codec_WriteRegister(0x04, 0xAF); /* SPK always OFF & HP always ON */
        OutputDev = 0xAF;
        break;

    case OUTPUT_DEVICE_BOTH:
        counter += Codec_WriteRegister(0x04, 0xAA); /* SPK always ON & HP always ON */
        OutputDev = 0xAA;
        break;

    case OUTPUT_DEVICE_AUTO:
        counter += Codec_WriteRegister(0x04, 0x05); /* Detect the HP or the SPK automatically */
        OutputDev = 0x05;
        break;    

    default:
        counter += Codec_WriteRegister(0x04, 0x05); /* Detect the HP or the SPK automatically */
        OutputDev = 0x05;
        break;
    }

