SoCXin/GD32E103/src/Project/USBFS/USB_Device/Audio/src/gd32e10x_audio_codec.c
    /* The DMA clock is not disabled, since it can be used by other streams */
}

/**
  * @brief  Starts playing audio stream from the audio Media.
  * @param  Addr: Pointer to the audio stream buffer
  * @param  Size: Number of data in the audio stream buffer
  * @retval None.
  */
void Audio_MAL_Play(uint32_t Addr, uint32_t Size)
{
    /* Enable the I2S DMA Stream*/
    dma_channel_disable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

    /* Clear the Interrupt flag */
    dma_interrupt_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, DMA_INT_FLAG_FTF);

    /* Configure the buffer address and size */
    DMA_InitStructure.memory_addr = (uint32_t)Addr;
    DMA_InitStructure.number = (uint32_t)(Size*2);

    /* Configure the DMA Stream with the new parameters */
    dma_init(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, &DMA_InitStructure);

    /* Enable the I2S DMA Stream*/
    dma_channel_enable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

    /* If the I2S peripheral is still not enabled, enable it */
    if ((SPI_I2SCTL(CODEC_I2S) & I2S_ENABLE_MASK) == 0) {
        i2s_enable(CODEC_I2S);
    }
}

/**
  * @brief  Pauses or Resumes the audio stream playing from the Media.
  * @param  Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *         from 0) to resume. 
  * @param  Addr: Address from/at which the audio stream should resume/pause.
  * @param  Size: Number of data to be configured for next resume.
  * @retval None.
  */
void Audio_MAL_PauseResume(uint32_t Cmd, uint32_t Addr, uint32_t Size)
{
    /* Pause the audio file playing */
    if (Cmd == AUDIO_PAUSE) {
        /* Stop the current DMA request by resetting the I2S cell */
        Codec_AudioInterface_DeInit();

        /* Re-configure the I2S interface for the next resume operation */
        Codec_AudioInterface_Init(I2S_AudioFreq);

        /* Disable the DMA Stream */
        dma_channel_disable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

        /* Clear the Interrupt flag */
        dma_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_ALL);

    /* AUDIO_RESUME */
    } else {
        /* Configure the buffer address and size */
        DMA_InitStructure.memory_addr = (uint32_t)Addr;
        DMA_InitStructure.number = (uint32_t)(Size*2);

        /* Configure the DMA Stream with the new parameters */
        dma_init(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, &DMA_InitStructure);

        /* Enable the I2S DMA Stream*/
        dma_channel_enable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

        /* If the I2S peripheral is still not enabled, enable it */
        if ((SPI_I2SCTL(CODEC_I2S) & I2S_ENABLE_MASK) == 0) {
            i2s_enable(CODEC_I2S);
        }
    }
}

/**
  * @brief  Stops audio stream playing on the used Media.
  * @param  None.
  * @retval None.
  */
void Audio_MAL_Stop(void)
{
    /* Stop the Transfer on the I2S side: Stop and disable the DMA stream */
    dma_channel_disable(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL);

    /* Clear all the DMA flags for the next transfer */
    dma_flag_clear(AUDIO_MAL_DMA, AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_ALL);

    /* Stop the current DMA request by resetting the I2S cell */
    Codec_AudioInterface_DeInit();

    /* Re-configure the I2S interface for the next paly operation */
    Codec_AudioInterface_Init(I2S_AudioFreq);
}
